app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE ((name like '%h%' and age >= 15 and state = 'SC') or (name like '%h%' and age >= 30 and state = 'SP'))
---
    def index
        @segmentation_id = params[:segmentation_id]
        # get segmentation filters
        # make groups
        # filter by groups
        ### select * from contacts where (group 0) or (group 1) or (group 2)
        @contacts = Contact.where('(name like ? and age >= ? and state = ?) or (name like ? and age >= ? and state = ?)', '%h%', 15, 'SC', '%h%', 10, 'SP')