app/controllers/contacts_controller.rb

SELECT "segmentation_filters".* FROM "segmentation_filters" WHERE (segmentation_id = '19')
---
    def index
        @segmentation_id = params[:segmentation_id]
        @segments = Segmentation.all

        if @segmentation_id.to_i > 0
            @segmentation_filters = SegmentationFilter.where('segmentation_id = ?', @segmentation_id)