app/controllers/segments_controller.rb

    def index
        @segments = Segmentation.all
---
SELECT "segmentations".* FROM "segmentations"

    def create
        @segmentation = Segmentation.new(segment_params)
        @segmentation.save
        @filters = segment_filters_params
        @f = ''

        @filters.each do |filter|
            filter['segmentation'] = @segmentation
            @segmentation_filter = SegmentationFilter.new(filter)
            @segmentation_filter.save
---
INSERT INTO "segmentations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Product"], ["created_at", "2017-08-25 22:19:25.715308"], ["updated_at", "2017-08-25 22:19:25.715308"]]
INSERT INTO "segmentation_filters" ("segmentation_id", "group", "field", "operation", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)